{   "backend": "tensorflow",
    "class_name": "Functional",
    "config": {   "input_layers": [["input_0", 0, 0]],
                  "layers": [   {   "class_name": "InputLayer",
                                    "config": {   "batch_input_shape": [   None,
                                                                           1690],
                                                  "dtype": "float32",
                                                  "name": "input_0",
                                                  "ragged": false,
                                                  "sparse": false},
                                    "inbound_nodes": [],
                                    "name": "input_0"},
                                {   "class_name": "Dense",
                                    "config": {   "activation": "linear",
                                                  "activity_regularizer": None,
                                                  "bias_constraint": None,
                                                  "bias_initializer": {   "class_name": "Zeros",
                                                                          "config": {   }},
                                                  "bias_regularizer": 1e-5,
                                                  "dtype": "float32",
                                                  "kernel_constraint": None,
                                                  "kernel_initializer": {   "class_name": "GlorotUniform",
                                                                            "config": {   "seed": None}},
                                                  "kernel_regularizer": None,
                                                  "name": "dense",
                                                  "trainable": true,
                                                  "units": 80,
                                                  "use_bias": true},
                                    "inbound_nodes": [[["input_0", 0, 0, {}]]],
                                    "name": "dense"},
                                {   "class_name": "Activation",
                                    "config": {   "activation": "sigmoid",
                                                  "dtype": "float32",
                                                  "name": "activation",
                                                  "trainable": true},
                                    "inbound_nodes": [[["dense", 0, 0, {}]]],
                                    "name": "activation"},
                                {   "class_name": "Dense",
                                    "config": {   "activation": "linear",
                                                  "activity_regularizer": None,
                                                  "bias_constraint": None,
                                                  "bias_initializer": {   "class_name": "Zeros",
                                                                          "config": {   }},
                                                  "bias_regularizer": 1e-5,
                                                  "dtype": "float32",
                                                  "kernel_constraint": None,
                                                  "kernel_initializer": {   "class_name": "GlorotUniform",
                                                                            "config": {   "seed": None}},
                                                  "kernel_regularizer": None,
                                                  "name": "dense_1",
                                                  "trainable": true,
                                                  "units": 80,
                                                  "use_bias": true},
                                    "inbound_nodes": [[["input_0", 0, 0, {}]]],
                                    "name": "dense_1"},
                                {   "class_name": "Add",
                                    "config": {   "dtype": "float32",
                                                  "name": "add",
                                                  "trainable": true},
                                    "inbound_nodes": [   [   [   "activation",
                                                                 0,
                                                                 0,
                                                                 {}],
                                                             [   "dense_1",
                                                                 0,
                                                                 0,
                                                                 {}]]],
                                    "name": "add"},
                                {   "class_name": "Activation",
                                    "config": {   "activation": "relu",
                                                  "dtype": "float32",
                                                  "name": "activation_1",
                                                  "trainable": true},
                                    "inbound_nodes": [[["add", 0, 0, {}]]],
                                    "name": "activation_1"},
                                {   "class_name": "Dense",
                                    "config": {   "activation": "linear",
                                                  "activity_regularizer": None,
                                                  "bias_constraint": None,
                                                  "bias_initializer": {   "class_name": "Zeros",
                                                                          "config": {   }},
                                                  "bias_regularizer": 1e-5,
                                                  "dtype": "float32",
                                                  "kernel_constraint": None,
                                                  "kernel_initializer": {   "class_name": "GlorotUniform",
                                                                            "config": {   "seed": None}},
                                                  "kernel_regularizer": None,
                                                  "name": "dense_2",
                                                  "trainable": true,
                                                  "units": 96,
                                                  "use_bias": true},
                                    "inbound_nodes": [   [   [   "activation_1",
                                                                 0,
                                                                 0,
                                                                 {}]]],
                                    "name": "dense_2"},
                                {   "class_name": "Activation",
                                    "config": {   "activation": "tanh",
                                                  "dtype": "float32",
                                                  "name": "activation_2",
                                                  "trainable": true},
                                    "inbound_nodes": [[["dense_2", 0, 0, {}]]],
                                    "name": "activation_2"},
                                {   "class_name": "Dense",
                                    "config": {   "activation": "linear",
                                                  "activity_regularizer": None,
                                                  "bias_constraint": None,
                                                  "bias_initializer": {   "class_name": "Zeros",
                                                                          "config": {   }},
                                                  "bias_regularizer": 1e-5,
                                                  "dtype": "float32",
                                                  "kernel_constraint": None,
                                                  "kernel_initializer": {   "class_name": "GlorotUniform",
                                                                            "config": {   "seed": None}},
                                                  "kernel_regularizer": None,
                                                  "name": "dense_3",
                                                  "trainable": true,
                                                  "units": 96,
                                                  "use_bias": true},
                                    "inbound_nodes": [   [   [   "activation_1",
                                                                 0,
                                                                 0,
                                                                 {}]]],
                                    "name": "dense_3"},
                                {   "class_name": "Add",
                                    "config": {   "dtype": "float32",
                                                  "name": "add_1",
                                                  "trainable": true},
                                    "inbound_nodes": [   [   [   "activation_2",
                                                                 0,
                                                                 0,
                                                                 {}],
                                                             [   "dense_3",
                                                                 0,
                                                                 0,
                                                                 {}]]],
                                    "name": "add_1"},
                                {   "class_name": "Activation",
                                    "config": {   "activation": "relu",
                                                  "dtype": "float32",
                                                  "name": "activation_3",
                                                  "trainable": true},
                                    "inbound_nodes": [[["add_1", 0, 0, {}]]],
                                    "name": "activation_3"},
                                {   "class_name": "Dense",
                                    "config": {   "activation": "linear",
                                                  "activity_regularizer": None,
                                                  "bias_constraint": None,
                                                  "bias_initializer": {   "class_name": "Zeros",
                                                                          "config": {   }},
                                                  "bias_regularizer": 1e-5,
                                                  "dtype": "float32",
                                                  "kernel_constraint": None,
                                                  "kernel_initializer": {   "class_name": "GlorotUniform",
                                                                            "config": {   "seed": None}},
                                                  "kernel_regularizer": None,
                                                  "name": "dense_4",
                                                  "trainable": true,
                                                  "units": 80,
                                                  "use_bias": true},
                                    "inbound_nodes": [   [   [   "activation_3",
                                                                 0,
                                                                 0,
                                                                 {}]]],
                                    "name": "dense_4"},
                                {   "class_name": "Activation",
                                    "config": {   "activation": "sigmoid",
                                                  "dtype": "float32",
                                                  "name": "activation_4",
                                                  "trainable": true},
                                    "inbound_nodes": [[["dense_4", 0, 0, {}]]],
                                    "name": "activation_4"},
                                {   "class_name": "Dense",
                                    "config": {   "activation": "linear",
                                                  "activity_regularizer": None,
                                                  "bias_constraint": None,
                                                  "bias_initializer": {   "class_name": "Zeros",
                                                                          "config": {   }},
                                                  "bias_regularizer": 1e-5,
                                                  "dtype": "float32",
                                                  "kernel_constraint": None,
                                                  "kernel_initializer": {   "class_name": "GlorotUniform",
                                                                            "config": {   "seed": None}},
                                                  "kernel_regularizer": None,
                                                  "name": "dense_5",
                                                  "trainable": true,
                                                  "units": 80,
                                                  "use_bias": true},
                                    "inbound_nodes": [[["input_0", 0, 0, {}]]],
                                    "name": "dense_5"},
                                {   "class_name": "Dense",
                                    "config": {   "activation": "linear",
                                                  "activity_regularizer": None,
                                                  "bias_constraint": None,
                                                  "bias_initializer": {   "class_name": "Zeros",
                                                                          "config": {   }},
                                                  "bias_regularizer": 1e-5,
                                                  "dtype": "float32",
                                                  "kernel_constraint": None,
                                                  "kernel_initializer": {   "class_name": "GlorotUniform",
                                                                            "config": {   "seed": None}},
                                                  "kernel_regularizer": None,
                                                  "name": "dense_6",
                                                  "trainable": true,
                                                  "units": 80,
                                                  "use_bias": true},
                                    "inbound_nodes": [   [   [   "activation_3",
                                                                 0,
                                                                 0,
                                                                 {}]]],
                                    "name": "dense_6"},
                                {   "class_name": "Add",
                                    "config": {   "dtype": "float32",
                                                  "name": "add_2",
                                                  "trainable": true},
                                    "inbound_nodes": [   [   [   "activation_4",
                                                                 0,
                                                                 0,
                                                                 {}],
                                                             [   "dense_5",
                                                                 0,
                                                                 0,
                                                                 {}],
                                                             [   "activation_1",
                                                                 0,
                                                                 0,
                                                                 {}],
                                                             [   "dense_6",
                                                                 0,
                                                                 0,
                                                                 {}]]],
                                    "name": "add_2"},
                                {   "class_name": "Activation",
                                    "config": {   "activation": "relu",
                                                  "dtype": "float32",
                                                  "name": "activation_5",
                                                  "trainable": true},
                                    "inbound_nodes": [[["add_2", 0, 0, {}]]],
                                    "name": "activation_5"},
                                {   "class_name": "Dense",
                                    "config": {   "activation": "linear",
                                                  "activity_regularizer": None,
                                                  "bias_constraint": None,
                                                  "bias_initializer": {   "class_name": "Zeros",
                                                                          "config": {   }},
                                                  "bias_regularizer": 1e-5,
                                                  "dtype": "float32",
                                                  "kernel_constraint": None,
                                                  "kernel_initializer": {   "class_name": "GlorotUniform",
                                                                            "config": {   "seed": None}},
                                                  "kernel_regularizer": None,
                                                  "name": "dense_7",
                                                  "trainable": true,
                                                  "units": 1,
                                                  "use_bias": true},
                                    "inbound_nodes": [   [   [   "activation_5",
                                                                 0,
                                                                 0,
                                                                 {}]]],
                                    "name": "dense_7"}],
                  "name": "model_1",
                  "output_layers": [["dense_7", 0, 0]]},
    "keras_version": "2.4.0"}
